SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_ESP8266_core-1.0.0/boards.txt
##############################################################
connect.name=Dasduino Connect (ESP8266)
connect.build.board=ESP8266_GENERIC
connect.upload.tool=esptool
connect.upload.maximum_data_size=81920
connect.upload.wait_for_upload_port=true
connect.upload.erase_cmd=
connect.serial.disableDTR=true
connect.serial.disableRTS=true
connect.build.mcu=esp8266
connect.build.core=esp8266
connect.build.variant=generic
connect.build.spiffs_pagesize=256
connect.build.debug_port=
connect.build.debug_level=
connect.build.f_cpu=80000000L
connect.build.vtable_flags=-DVTABLES_IN_FLASH
connect.build.exception_flags=-fno-exceptions
connect.build.stdcpp_lib=-lstdc++
connect.upload.resetmethod=nodemcu
connect.build.flash_freq=40
connect.build.flash_mode=qio
connect.build.flash_flags=-DFLASHMODE_QIO
connect.build.flash_size=4M
connect.build.flash_size_bytes=0x400000
connect.build.flash_ld=eagle.flash.4m1m.ld
connect.build.spiffs_pagesize=256
connect.upload.maximum_size=1044464
connect.build.rfcal_addr=0x3FC000
connect.build.spiffs_start=0x300000
connect.build.spiffs_end=0x3FB000
connect.build.spiffs_blocksize=8192
connect.build.led=-DLED_BUILTIN=13
connect.build.lwip_include=lwip2/include
connect.build.lwip_lib=-llwip2-536-feat
connect.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
connect.build.debug_port=
connect.build.debug_level=
connect.upload.erase_cmd=
connect.upload.speed=921600
